; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-15)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 room5 room6 left ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(room room5)
(room room6)
(gripper left)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(free left)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 room3)
(at ball4 room3)
(at ball5 room3)
(at ball6 room3)
(at ball7 room4)
(at ball8 room4)
(at ball9 room4)
(at ball10 room5)
(at ball11 room6)
(at ball12 room6)
(at ball13 room6)
(at ball14 room6)
(at ball15 room6)
(at-robby rooma)
)
(:goal
(and
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 roomb)
(at ball6 room3)
(at ball7 room3)
(at ball8 room3)
(at ball9 room3)
(at ball10 room4)
(at ball11 room4)
(at ball12 room5)
(at ball13 room5)
(at ball14 room5)
(at ball15 room6)
)
)
)

; plan
1. (move rooma room6)
   deleted: (at-robby rooma)
   added: (at-robby room6)
   goals met: 4 of 15
2. (pick ball14 room6 left)
   deleted: (at ball14 room6) (free left)
   added: (carry ball14 left)
   goals met: 4 of 15
3. (move room6 room5)
   deleted: (at-robby room6)
   added: (at-robby room5)
   goals met: 4 of 15
4. (drop ball14 room5 left)
   deleted: (carry ball14 left)
   added: (at ball14 room5) (free left)
   goals met: 5 of 15
5. (pick ball10 room5 left)
   deleted: (at ball10 room5) (free left)
   added: (carry ball10 left)
   goals met: 5 of 15
6. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 5 of 15
7. (drop ball10 room4 left)
   deleted: (carry ball10 left)
   added: (at ball10 room4) (free left)
   goals met: 6 of 15
8. (pick ball9 room4 left)
   deleted: (at ball9 room4) (free left)
   added: (carry ball9 left)
   goals met: 6 of 15
9. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 6 of 15
10. (drop ball9 room3 left)
   deleted: (carry ball9 left)
   added: (at ball9 room3) (free left)
   goals met: 7 of 15
11. (pick ball5 room3 left)
   deleted: (at ball5 room3) (free left)
   added: (carry ball5 left)
   goals met: 7 of 15
12. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 7 of 15
13. (drop ball5 roomb left)
   deleted: (carry ball5 left)
   added: (at ball5 roomb) (free left)
   goals met: 8 of 15
14. (move roomb room6)
   deleted: (at-robby roomb)
   added: (at-robby room6)
   goals met: 8 of 15
15. (pick ball13 room6 left)
   deleted: (at ball13 room6) (free left)
   added: (carry ball13 left)
   goals met: 8 of 15
16. (move room6 room5)
   deleted: (at-robby room6)
   added: (at-robby room5)
   goals met: 8 of 15
17. (drop ball13 room5 left)
   deleted: (carry ball13 left)
   added: (at ball13 room5) (free left)
   goals met: 9 of 15
18. (move room5 room6)
   deleted: (at-robby room5)
   added: (at-robby room6)
   goals met: 9 of 15
19. (pick ball12 room6 left)
   deleted: (at ball12 room6) (free left)
   added: (carry ball12 left)
   goals met: 9 of 15
20. (move room6 room5)
   deleted: (at-robby room6)
   added: (at-robby room5)
   goals met: 9 of 15
21. (drop ball12 room5 left)
   deleted: (carry ball12 left)
   added: (at ball12 room5) (free left)
   goals met: 10 of 15
22. (move room5 room6)
   deleted: (at-robby room5)
   added: (at-robby room6)
   goals met: 10 of 15
23. (pick ball11 room6 left)
   deleted: (at ball11 room6) (free left)
   added: (carry ball11 left)
   goals met: 10 of 15
24. (move room6 room4)
   deleted: (at-robby room6)
   added: (at-robby room4)
   goals met: 10 of 15
25. (drop ball11 room4 left)
   deleted: (carry ball11 left)
   added: (at ball11 room4) (free left)
   goals met: 11 of 15
26. (pick ball8 room4 left)
   deleted: (at ball8 room4) (free left)
   added: (carry ball8 left)
   goals met: 11 of 15
27. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 11 of 15
28. (drop ball8 room3 left)
   deleted: (carry ball8 left)
   added: (at ball8 room3) (free left)
   goals met: 12 of 15
29. (pick ball4 room3 left)
   deleted: (at ball4 room3) (free left)
   added: (carry ball4 left)
   goals met: 12 of 15
30. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 12 of 15
31. (drop ball4 rooma left)
   deleted: (carry ball4 left)
   added: (at ball4 rooma) (free left)
   goals met: 13 of 15
32. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 13 of 15
33. (pick ball7 room4 left)
   deleted: (at ball7 room4) (free left)
   added: (carry ball7 left)
   goals met: 13 of 15
34. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 13 of 15
35. (drop ball7 room3 left)
   deleted: (carry ball7 left)
   added: (at ball7 room3) (free left)
   goals met: 14 of 15
36. (pick ball3 room3 left)
   deleted: (at ball3 room3) (free left)
   added: (carry ball3 left)
   goals met: 14 of 15
37. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 14 of 15
38. (drop ball3 rooma left)
   deleted: (carry ball3 left)
   added: (at ball3 rooma) (free left)
   goals met: 15 of 15
